---
kind: property
id: P:Autodesk.Revit.UI.ColorSelectionDialog.OriginalColor
source: html/6d76dc9c-04ef-f273-12b0-e359f5c3a13f.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog.OriginalColor Property

The original color.

## Syntax (C#)
```csharp
public Color OriginalColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null